Show / Hide Table of Contents
Enum LongReinfEndType
End type of longitudional reinforcement
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum LongReinfEndType
Fields
 Name |  Description
 Bend
Bend
 ContinuousBar
Continuous bar - full anchorage
 ContinuousBarOutside
Continuous bar outside - no anchorage
 Hook
Hook
 Hook180DegreeACI
180 degree hook for ACI
 Hook90DegreeACI
90 degree hook for ACI
 Loop
Loop
 None
None
 WeldedTransverseBar
WeldedTransverseBar
 Improve this Doc
 View Source